---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData.IsCurrentEntityValid
source: html/6348836b-0dcf-957d-4dda-652266014a60.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData.IsCurrentEntityValid Property

True if the current settings stored in the entity is valid.

## Syntax (C#)
```csharp
public bool IsCurrentEntityValid { get; set; }
```